[
  {
    "id": "4",
    "title": "وِش کے لیے برانڈنگ اور ویب سائٹ ڈویلپمنٹ",
    "company": "وِش",
    "hasPage": true,
    "year": "2025",
    "description": "ویب سائٹ ڈیزائن، ڈویلپمنٹ اور برانڈنگ",
    "imageSrc": "/images/projects/wish-2024/wishapparels.com_.webp",
    "url": "https://wishapparels.com/",
    "coverImage": "/images/projects/wish-2024/wishapparels.com_.webp",
    "coverImageAlt": "وِش اسٹور کا آغاز",
    "page": {
      "excerpt": "وِش ایپریلز کے ساتھ ہمارے تعاون میں ایک ایسا ڈیجیٹل تجربہ تخلیق کرنا شامل تھا جو ان کے آنے والے کپڑوں کے لائن کے معیار اور اسٹائل کو ظاہر کرے۔ ہم نے ایک انٹیوٹیو ای کامرس پلیٹ فارم ڈیزائن کیا جو نہ صرف ان کے مصنوعات کو اعلیٰ معیار کی تصاویر اور تفصیلی معلومات کے ساتھ پیش کرتا ہے بلکہ ایک آرام دہ اور محفوظ خریداری کا سفر بھی فراہم کرتا ہے۔ برانڈنگ اور ڈیزائن کے عناصر، جو ویب سائٹ کے ساتھ مل کر تیار کیے گئے ہیں، برانڈ کے نظریات کو مؤثر طریقے سے بیان کرنے اور ان کے ہدف کے سامعین کو متوجہ کرنے کے لیے ہم آہنگی سے کام کرتے ہیں۔ یہ منصوبہ ہماری ایجنسی کے عزم کو ظاہر کرتا ہے کہ ہم ایسے مؤثر ڈیجیٹل حل تخلیق کریں جو جدت پسند کاروباروں کے لیے برانڈ کی ترقی اور گاہک کی مصروفیت کو بڑھائیں۔",
      "splitSections": [
        {
          "heading": "چیلنجز",
          "content": "نیا برانڈ شناخت قائم کرنا: چونکہ وِش ایپریلز مارکیٹ میں ایک نیا داخل ہونے والا تھا، ایک اہم چیلنج یہ تھا کہ زمین سے ایک الگ اور یادگار برانڈ شناخت تخلیق کی جائے۔ اس میں ایک بصری زبان تیار کرنا شامل تھا جو ان کے ہدف کے آبادیاتی گروپ سے ہم آہنگ ہو اور لوگو ڈیزائن، ٹائپوگرافی، رنگوں کے پلیٹس اور مجموعی جمالیات کے ذریعے ان کے برانڈ اقدار کو مؤثر طریقے سے بیان کرے۔ ایک قابل توسیع ای کامرس پلیٹ فارم بنانا: ہمیں ایک ایسی ای کامرس ویب سائٹ تیار کرنی تھی جو نہ صرف بصری طور پر پرکشش اور صارف دوست ہو بلکہ مضبوط اور قابل توسیع بھی ہو تاکہ مستقبل میں مصنوعات کی پیشکش اور گاہک کی ٹریفک کو ایڈجسٹ کیا جا سکے۔ مصنوعات کی براؤزنگ، محفوظ چیک آؤٹ، اور انوینٹری مینجمنٹ جیسی ضروری خصوصیات کا بے عیب انضمام یقینی بنانا بہت اہم تھا۔",
          "tags": ["برانڈ ڈویلپمنٹ", "بصری شناخت", "شوپائف", "UI/UX ڈیزائن"]
        },
        {
          "heading": "تحریک",
          "content": "منیملست ایلیگنس: ڈیزائن کی سمت بڑی حد تک منیملست ایلیگنس کی خواہش سے متاثر تھی، جس سے کپڑوں کو مرکزی توجہ حاصل ہو۔ صاف لکیریں، کافی سفید جگہ، اور نفیس ٹائپوگرافی کو استعمال کرتے ہوئے ایک غیر واضح شان و شوکت اور لازوال اسٹائل کا احساس پیدا کیا گیا۔ بصری کہانی پر توجہ: فیشن میں بصری اپیل کی اہمیت کو تسلیم کرتے ہوئے، ہم نے ایک ایسا پلیٹ فارم بنانے پر توجہ مرکوز کی جو اعلیٰ معیار کی تصویر کشی اور پرکشش بصری کہانی کو ترجیح دے۔ ویب سائٹ ڈیزائن کا مقصد صارفین کو برانڈ کی دنیا میں غرق کرنا اور کپڑوں کو ایک پرکشش اور متاثر کن انداز میں پیش کرنا تھا۔"
        }
      ],
      "upperSlideshow": [
        "/images/projects/wish-2024/upper-slideshow-1.webp",
        "/images/projects/wish-2024/1743813808292_100.webp",
        "/images/projects/wish-2024/wish-girl-11.webp",
        "/images/projects/wish-2024/wish-boy-1.webp",
        "/images/projects/wish-2024/wish-logo.webp",
        "/images/projects/wish-2024/with-other-dev.webp"
      ],
      "testimonial": {
        "content": "دیگر ڈیو کے ساتھ کام کرنا وِش ایپریلز کے لیے ایک گیم چینجر ثابت ہوا۔ ویب سائٹ ڈویلپمنٹ اور برانڈنگ کے لیے ان کے جامع نقطہ نظر نے ہماری توقعات سے کہیں زیادہ نتائج فراہم کیے۔ نئی ویب سائٹ کا صارف دوست ڈیزائن اور پرکشش پیشکش نے براہ راست 500% فروخت میں اضافے میں حصہ ڈالا۔ ان کی تیار کردہ برانڈنگ نفیس، یادگار اور ہماری برانڈ شناخت کو عین عکاسی کرتی ہے، جسے ہم نے اپنے کاروبار کے تمام پہلوؤں میں فخر سے اپنایا ہے۔ ہم دیگر ڈیو کو کسی بھی ابھرتے ہوئے برانڈ کو سفارش کرتے ہیں جو مؤثر ڈیجیٹل حل تلاش کر رہا ہو۔",
        "author": "طلحہ، وِش کے بانی"
      },
      "secondCover": "https://images.unsplash.com/photo-1509114397022-ed747cca3f65?q=80&w=1935&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "1",
    "title": "نارکنز بلڈرز کے لیے ویب سائٹ انفراسٹرکچر کی تخلیق",
    "company": "نارکنز",
    "hasPage": true,
    "year": "2025",
    "description": "ویب سائٹ ڈیزائن، ڈویلپمنٹ اور انفراسٹرکچر",
    "imageSrc": "/images/projects/narkins-2025/narkinsbuilders.com_.webp",
    "url": "/blog/fdc784b9-2f1d-43a2-8919-658ec1901491",
    "coverImage": "/images/projects/narkins-2025/narkinsbuilders.com_.webp",
    "coverImageAlt": "نارکنز بلڈرز ویب سائٹ کا آغاز",
    "page": {
      "excerpt": "ہم نے نارکنز بلڈرز، ایک معروف تعمیراتی کمپنی کے ساتھ شراکت کی تاکہ ایک مضبوط اور قابل توسیع ویب سائٹ انفراسٹرکچر تخلیق کیا جا سکے جو ان کی آن لائن موجودگی کی بنیاد بنے۔ اس منصوبے میں ان کے تعمیراتی منصوبوں کے پورٹ فولیو کو پیش کرنے، ان کی خدمات کے بارے میں تفصیلی معلومات فراہم کرنے اور کلائنٹ کی استفسارات کو آسان بنانے کے لیے ایک صارف دوست پلیٹ فارم ڈیزائن کرنا اور تیار کرنا شامل تھا۔ ہمارا فوکس ایک قابل اعتماد اور موثر نظام بنانے پر تھا جو نارکنز بلڈرز کی ترقی کو سپورٹ کرے اور اسٹیک ہولڈرز کے ساتھ ان کے ڈیجیٹل مواصلات کو بہتر بنائے۔",
      "splitSections": [
        {
          "heading": "چیلنجز",
          "content": "ایک قابل توسیع انفراسٹرکچر تیار کرنا: نارکنز بلڈرز کو ایک ویب سائٹ انفراسٹرکچر کی ضرورت تھی جو تصاویر، پلانز اور تکنیکی تفصیلات سمیت منصوبوں کے اعداد و شمار کے بڑے حجم کو سنبھال سکے۔ ہمیں ایک ایسا نظام ڈیزائن کرنا تھا جو اس معلومات کو مؤثر طریقے سے منظم اور ظاہر کر سکے جبکہ ویب سائٹ کی کارکردگی کو بہتر بنائے۔ پروجیکٹ مینجمنٹ ٹولز کو ضم کرنا: کلائنٹ مواصلات اور پروجیکٹ اپ ڈیٹس کو آسان بنانے کے لیے، ہم نے پروجیکٹ مینجمنٹ ٹولز کو ویب سائٹ میں ضم کیا، جس سے بے عیب تعامل اور معلومات کا اشتراک ممکن ہوا۔ ہم نے مطابقت اور حفاظت کو یقینی بنانے کے لیے احتیاط سے منصوبہ بندی اور عمل درآمد کیا۔ ڈیٹا سیکورٹی اور اعتماد کو یقینی بنانا: تعمیراتی ڈیٹا کی حساس نوعیت کو مدنظر رکھتے ہوئے، جس میں معاہدے اور بلیو پرنٹس شامل ہیں، ڈیٹا سیکورٹی اور نظام کی اعتماد کو یقینی بنانا بہت اہم تھا۔ ہم نے ڈیٹا کے نقصان اور غیر مجاز رسائی سے بچاؤ کے لیے صنعت کے معیاری حفاظتی اقدامات اور بیک اپ پروٹوکولز نافذ کیے۔",
          "tags": [
            "ویب ڈویلپمنٹ",
            "انفراسٹرکچر",
            "ڈیٹا بیس ڈیزائن",
            "API انضمام",
            "پروجیکٹ مینجمنٹ ٹولز",
            "ڈیٹا سیکورٹی"
          ]
        },
        {
          "heading": "ہمارا نقطہ نظر",
          "content": "ماڈیولر ڈیزائن اور ڈویلپمنٹ: ہم نے ایک ماڈیولر ڈیزائن اور ڈویلپمنٹ کا نقطہ نظر اپنایا، جس سے نارکنز بلڈرز کی ضروریات کے مطابق لچک اور توسیع ممکن ہو۔ اس میں دوبارہ استعمال کے قابل اجزاء اور ایک اچھی طرح سے ساختہ کوڈ بیس تخلیق کرنا شامل تھا۔ مواد کے انتظام کا نظام (CMS) نافذ کرنا: ہم نے ایک صارف دوست CMS نافذ کیا، جس سے نارکنز بلڈرز کو وسیع تکنیکی مہارت کی ضرورت کے بغیر ویب سائٹ کے مواد کو اپ ڈیٹ کرنے، نئے منصوبے شامل کرنے اور کلائنٹ کی استفسارات کو منظم کرنے میں آسانی ہوئی۔ کارکردگی کی اصلاح: ہم نے ویب سائٹ کی کارکردگی کو بہتر بنانے پر توجہ مرکوز کی تاکہ تمام آلات پر تیز لوڈنگ اوقات اور ایک ہموار صارف تجربہ یقینی بنایا جا سکے۔ اس میں تصویر کی اصلاح، کیشنگ کی حکمت عملی اور موثر کوڈ کی کارکردگی شامل تھیں۔",
          "tags": [
            "CMS (مثلاً ورڈپریس، ڈروپل)",
            "کارکردگی کی اصلاح",
            "ریسپونسیو ڈیزائن",
            "ماڈیولر ڈیزائن",
            "صارف تجربہ (UX)",
            "مواد کا انتظام"
          ]
        }
      ],
      "upperSlideshow": [
        "/images/projects/narkins-2025/narkins-collage.webp",
        "/images/projects/narkins-2025/1743813250549_100.webp",
        "/images/projects/narkins-2025/hcr_new.webp"
      ],
      "testimonial": {
        "content": "دیگر ڈیو نے ہمیں ایک ویب سائٹ انفراسٹرکچر فراہم کیا جس نے ہمارے آن لائن آپریشنز کو نمایاں طور پر بہتر بنایا ہے۔ پیچیدہ ڈیٹا کو سنبھالنے اور اہم ٹولز کو ضم کرنے میں ان کی ٹیم کی مہارت نے ہمارے پروجیکٹ مینجمنٹ کو آسان بنایا ہے اور ہمارے کلائنٹس کے ساتھ مواصلات کو بہتر بنایا ہے۔ ویب سائٹ مضبوط، صارف دوست ہے اور ہمیں اپنے کام کو مؤثر طریقے سے پیش کرنے میں مدد ملی ہے۔ ہم دیگر ڈیو کی پیشہ ورانہ صلاحیت اور اعلیٰ معیار کے حل فراہم کرنے کے عزم کی تعریف کرتے ہیں۔",
        "author": "سارم"
      },
      "secondCover": "https://images.unsplash.com/photo-1553877522-43269d4ea984?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "54",
    "title": "فن لٹ کے لیے برانڈنگ اور SaaS پلیٹ فارم کی ڈویلپمنٹ",
    "company": "فن لٹ",
    "hasPage": true,
    "year": "2025",
    "description": "انٹو اینڈ ڈیزائن، ویب سائٹ / SAAS ڈویلپمنٹ اور برانڈنگ۔",
    "imageSrc": "/images/projects/finlit-2025/finlit.deployments.otherdev.com_.png",
    "url": "https://finlit.deployments.otherdev.com/",
    "coverImage": "/images/projects/finlit-2025/finlit.deployments.otherdev.com_.png",
    "coverImageAlt": "فن لٹ SaaS پلیٹ فارم انٹرفیس",
    "page": {
      "excerpt": "فن لٹ کے ساتھ ہمارے تعاون میں ان کے SaaS پلیٹ فارم کی جامع تخلیق شامل تھی، ابتدائی برانڈنگ اور بصری شناخت سے لے کر ایک انٹیوٹیو اور پرکشش لرننگ ایپلیکیشن کی مکمل اسٹیک ڈویلپمنٹ تک۔ ہم نے ایک منیملسٹ لیکن مؤثر ڈیجیٹل تجربہ فراہم کرنے پر توجہ مرکوز کی جو صارفین کو مالیات کی دنیا میں پراعتماد طریقے سے تشریف لے جانے کے قابل بناتا ہے۔",
      "splitSections": [
        {
          "heading": "منصوبے کے مقاصد",
          "content": "فن لٹ کے لیے بنیادی مقاصد ایک مضبوط اور قابل اعتماد برانڈ موجودگی قائم کرنا اور ایک صارف دوست SaaS پلیٹ فارم تیار کرنا تھا جو پیچیدہ مالی تصورات کو آسان بنائے۔ اس میں ایک واضح بصری شناخت تخلیق کرنا شامل تھا، جس میں لوگو ڈیزائن اور برانڈ گائیڈ لائنز شامل تھیں، اور ایک قابل توسیع ویب ایپلیکیشن بنانا تھا جس میں انٹرایکٹو لرننگ ماڈیولز، پیشرفت کی ٹریکنگ اور ایک بے عیب صارف تجربہ شامل ہو۔ ہمارا مقصد ایک ایسا پلیٹ فارم تخلیق کرنا تھا جو قابل رسائی اور مستند دونوں محسوس ہو، جو صارفین کو مالی تعلیم کے ساتھ فعال طور پر مشغول ہونے کی ترغیب دے۔",
          "tags": [
            "SaaS پلیٹ فارم ڈویلپمنٹ",
            "برانڈنگ حکمت عملی",
            "لوگو ڈیزائن",
            "UI/UX ڈیزائن",
            "ای لرننگ ڈویلپمنٹ",
            "مالی خواندگی"
          ]
        },
        {
          "heading": "برانڈنگ اور بصری شناخت",
          "content": "فن لٹ کے لیے، ہم نے ایک برانڈ شناخت تیار کی جو واضحیت اور قربت پر مرکوز تھی۔ لوگو ڈیزائن منیملسٹ اور صاف تھا، جو یادگار ہونے کے ساتھ ساتھ پلیٹ فارم کے مشن کو مالیات کو آسان بنانے کی عکاسی کرتا تھا۔ ہم نے ایک صاف اور جدید رنگوں کا پلیٹ اور ٹائپوگرافی کا نظام قائم کیا جو اعتماد اور سمجھنے میں آسانی کو ظاہر کرتا ہے۔ ان برانڈنگ عناصر کو احتیاط سے SaaS پلیٹ فارم کے ڈیزائن میں ضم کیا گیا، تاکہ تمام رابطہ نقاط پر ایک مربوط اور پیشہ ورانہ صارف تجربہ یقینی بنایا جا سکے۔",
          "tags": ["برانڈ شناخت", "لوگو ڈیزائن", "رنگوں کا پلیٹ", "ٹائپوگرافی", "بصری گائیڈ لائنز"]
        },
        {
          "heading": "SaaS پلیٹ فارم ڈویلپمنٹ",
          "content": "فن لٹ SaaS پلیٹ فارم کی ڈویلپمنٹ میں ایک پرکشش اور موثر لرننگ ماحول تخلیق کرنے پر توجہ مرکوز کی گئی۔ ہم نے ایک قابل توسیع ویب ایپلیکیشن بنائی جس میں ساختہ کورسز، انٹرایکٹو اسباق، کوئزز اور پیشرفت کی ٹریکنگ میکانزم شامل تھے۔ صارف انٹرفیس کو مواد کو ترجیح دینے اور توجہ کو کم کرنے کے لیے ایک منیملسٹ جمالیات کے ساتھ ڈیزائن کیا گیا تھا، تاکہ ایک مرکوز لرننگ تجربہ یقینی بنایا جا سکے۔ ہم نے صارف کے بہاؤ اور نیویگیشن پر خاص توجہ دی تاکہ صارفین کے لیے مالی علم بنانے کا ایک انٹیوٹیو اور خوشگوار راستہ تخلیق کیا جا سکے۔ پلیٹ فارم کو Astro, Next.js پر بنایا گیا اور Vercel پر ڈیپلائی کیا گیا، جس میں کارکردگی اور توسیع پر توجہ مرکوز کی گئی تاکہ بڑھتی ہوئی صارفین کی تعداد اور توسیع پذیر مواد لائبریری کو ایڈجسٹ کیا جا سکے۔",
          "tags": [
            "مکمل اسٹیک ڈویلپمنٹ",
            "SaaS آرکیٹیکچر",
            "ای لرننگ پلیٹ فارم ڈویلپمنٹ",
            "انٹرایکٹو مواد",
            "صارف کی پیشرفت کی ٹریکنگ",
            "توسیع"
          ]
        },
        {
          "heading": "ڈیزائن اور صارف تجربہ",
          "content": "فن لٹ کے لیے ہمارا ڈیزائن فلسفہ واضحیت اور استعمال میں آسانی کو ترجیح دیتا تھا۔ ہم نے ایک منیملسٹ جمالیات کو اپنایا جس میں کافی سفید جگہ اور واضح ٹائپوگرافی شامل تھی تاکہ پڑھنے میں آسانی اور علمی بوجھ کو کم کیا جا سکے۔ صارف انٹرفیس کو انٹیوٹیو اور مستقل بنایا گیا تھا، تاکہ صارفین کو پلیٹ فارم کو آسانی سے نیویگیٹ کرنے میں مدد ملے۔ ہم نے ایک بے عیب لرننگ بہاؤ تخلیق کرنے پر توجہ مرکوز کی، تاکہ صارفین کو کورس کے مواد تک آسانی سے رسائی حاصل ہو، اپنی پیشرفت کو ٹریک کر سکیں اور انٹرایکٹو عناصر کے ساتھ مشغول ہو سکیں۔ ہمارا مقصد ایک ڈیجیٹل لرننگ ماحول تخلیق کرنا تھا جو پیشہ ورانہ اور قابل رسائی دونوں محسوس ہو، جو مالی تعلیم کو سب کے لیے قابل رسائی بنائے۔",
          "tags": [
            "منیملسٹ ڈیزائن",
            "صارف تجربہ (UX)",
            "صارف انٹرفیس (UI)",
            "معلوماتی فن تعمیر",
            "قابل استعمال",
            "قابل رسائی"
          ]
        }
      ],
      "upperSlideshow": [
        "/images/projects/finlit-2025/finlit-group.png",
        "/images/projects/finlit-2025/finlit-home-mobile.png",
        "/images/projects/finlit-2025/team-groupchat.png",
        "/images/projects/finlit-2025/finlit-courses-macbook.png",
        "/images/projects/finlit-2025/finlit-logo.png",
        "/images/projects/finlit-2025/finlit.deployments.otherdev.com_trading_1x1.png"
      ],
      "testimonial": {
        "content": "فن لٹ کو زمین سے تیار کرنا ہماری ٹیم کے لیے ایک دلچسپ اور فائدہ مند منصوبہ تھا۔ ہم نے ایک جامع SaaS پلیٹ فارم تخلیق کرنے کے چیلنج کو قبول کیا جو مالی خواندگی کو سوچ سمجھ کر برانڈنگ اور انٹیوٹیو ڈیزائن کے ذریعے آسان بناتا ہے۔ یہ دیکھنا کہ فن لٹ افراد کو اپنے مالی مستقبل پر کنٹرول حاصل کرنے کے قابل بناتا ہے، اچھی طرح سے عمل میں لائے گئے ڈیجیٹل حل کی طاقت کی گواہی ہے۔",
        "author": "کبیر، دیگر ڈیو کے بانی"
      },
      "secondCover": "https://images.unsplash.com/photo-1550565211-5608309e310e?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "5",
    "title": "گرووی پاکستان کے لیے ویب سائٹ ڈویلپمنٹ",
    "company": "گرووی",
    "hasPage": true,
    "year": "2024",
    "description": "ویب سائٹ ڈویلپمنٹ اور شوپائف انٹیگریشنز",
    "imageSrc": "/images/projects/groovy-pakistan-2024/groovy-main.png",
    "url": "https://groovypakistan.com/",
    "coverImage": "/images/projects/groovy-pakistan-2024/groovy-main.png",
    "coverImageAlt": "گرووی پاکستان آن لائن اسٹور فرنٹ",
    "page": {
      "excerpt": "گرووی پاکستان کے ساتھ ہماری مصروفیت کا مرکز ان کی ای کامرس ویب سائٹ کا اسٹریٹجک ڈیزائن اور مضبوط ڈویلپمنٹ تھا۔ ہمارا مقصد ایک ایسا ڈیجیٹل اسپیس تعمیر کرنا تھا جو نہ صرف برانڈ کی متحرک روح کو عکاسی کرے بلکہ صارفین کے لیے ان کی مصنوعات کو دریافت کرنے اور خریدنے کا ایک سیدھا اور پرکشش راستہ بھی فراہم کرے۔",
      "splitSections": [
        {
          "heading": "کام",
          "content": "گرووی پاکستان کے ساتھ ہمارا کام ایک ڈیجیٹل اسٹور فرنٹ کی تعمیر پر مرکوز تھا جو ان کے برانڈ کی توانائی اور رسائی کو ظاہر کرے۔ ہم نے احتیاط سے ایک انٹیوٹیو ای کامرس پلیٹ فارم (groovypakistan.com) تیار کیا جو نہ صرف ان کے متنوع مصنوعات کی رینج کو پرکشش تصاویر اور جامع تفصیلات کے ساتھ پیش کرتا ہے بلکہ ایک ہموار اور محفوظ لین دین کا عمل بھی یقینی بناتا ہے۔ ویب سائٹ کا ڈیزائن اور صارف تجربہ ان کے ہدف کے آبادیاتی گروپ سے ہم آہنگ ہونے اور ایک بے عیب آن لائن خریداری کا ماحول فراہم کرنے کے لیے احتیاط سے تیار کیا گیا تھا۔ یہ منصوبہ ہمارے اسٹوڈیو کے عزم کو ظاہر کرتا ہے کہ ہم مؤثر ڈیجیٹل انفراسٹرکچر تعمیر کریں جو کاروباروں کو اپنے گاہکوں کے ساتھ مؤثر طریقے سے رابطہ قائم کرنے اور آن لائن ترقی کو فروغ دینے کے قابل بنائے۔"
        },
        {
          "heading": "ڈویلپمنٹ چیلنجز",
          "content": "گرووی پاکستان کے لیے، ایک بنیادی چیلنج ایک مربوط اور مؤثر آن لائن سیلز چینل قائم کرنا تھا جو ان کے متنوع گاہکوں کی ضروریات کو پورا کر سکے۔ اس میں ایک ویب سائٹ تخلیق کرنا شامل تھا جو بصری طور پر پرکشش اور انتہائی فعال ہو، جو مصنوعات کی براؤزنگ، آرڈر مینجمنٹ اور محفوظ ادائیگیوں کو بے عیب طریقے سے سنبھال سکے۔ مختلف آلات پر ایک ریسپونسیو ڈیزائن جو بے عیب طریقے سے کام کرے، ان کے وسیع سامعین تک پہنچنے کے لیے بھی ایک اہم غور تھا۔ مزید یہ کہ، پلیٹ فارم کو قابل توسیع ہونا ضروری تھا تاکہ ان کے ارتقا پذیر مصنوعات کیٹلاگ اور بڑھتی ہوئی گاہک ٹریفک کو ایڈجسٹ کیا جا سکے۔",
          "tags": [
            "ای کامرس پلیٹ فارم ڈویلپمنٹ",
            "صارف تجربہ (UX) ڈیزائن",
            "ریسپونسیو ویب ڈیزائن",
            "قابل توسیع فن تعمیر",
            "ادائیگی گیٹ وے انضمام"
          ]
        },
        {
          "heading": "ہمارا ویب سائٹ حل",
          "content": "ہمارا نقطہ نظر گرووی پاکستان کے لیے ایک صارف مرکوز ای کامرس تجربہ تعمیر کرنے پر مرکوز تھا۔ ہم نے واضح نیویگیشن، انٹیوٹیو تلاش اور فلٹرنگ کی فعالیت، اور بصری طور پر بھرپور مصنوعات کی پیشکش کو ترجیح دی تاکہ گاہکوں کو آسانی سے پیشکش تلاش کرنے اور ان کی تعریف کرنے میں مدد ملے۔ چیک آؤٹ کا عمل ہموار اور محفوظ بنایا گیا تھا، جس سے رکاوٹوں کو کم کیا گیا اور تبدیلیوں کو فروغ دیا گیا۔ بنیادی ٹیکنالوجی اسٹیک کو اس کی اعتماد اور توسیع کے لیے منتخب کیا گیا تھا، جو گرووی پاکستان کی آن لائن مارکیٹ میں ترقی کو سپورٹ کرنے کے لیے ایک مضبوط پلیٹ فارم یقینی بناتا ہے۔ ہم نے ایک ایسا ڈیجیٹل ماحول تخلیق کرنے پر توجہ مرکوز کی جو ان کے گاہکوں کے لیے قابل رسائی اور قابل اعتماد دونوں محسوس ہو۔"
        },
        {
          "heading": "اہم ویب سائٹ خصوصیات",
          "content": "گرووی پاکستان ویب سائٹ (groovypakistan.com) میں خصوصیات کی ایک رینج شامل ہے جو خاص طور پر آن لائن خریداری کے تجربے کو بہتر بنانے کے لیے ڈیزائن کی گئی ہیں۔ ان میں اعلیٰ ریزولوشن کی تصاویر اور جامع تفصیلات کے ساتھ تفصیلی مصنوعات کے صفحات، ان کیٹلاگ کو آسانی سے نیویگیٹ کرنے کے لیے ایک مضبوط تلاش اور فلٹرنگ کا نظام، آرڈر ٹریکنگ اور محفوظ معلومات کے لیے محفوظ صارف اکاؤنٹس، متعدد ادائیگی کے اختیارات کے ساتھ ایک سیدھا شاپنگ کارٹ اور چیک آؤٹ بہاؤ، اور مربوط گاہک سپورٹ چینلز شامل ہیں۔ ہر عنصر کو استعمال اور کارکردگی پر توجہ کے ساتھ نافذ کیا گیا تھا، جس کا مقصد گرووی پاکستان کے آن لائن خریداروں کے لیے ایک مثبت اور بے عیب سفر تخلیق کرنا تھا۔",
          "tags": [
            "مصنوعات کی نمائش",
            "اعلیٰ درجے کی تلاش اور فلٹرنگ",
            "صارف اکاؤنٹ مینجمنٹ",
            "آسان چیک آؤٹ",
            "ادائیگی کا انضمام",
            "گاہک سپورٹ خصوصیات"
          ]
        }
      ],
      "upperSlideshow": [
        "/images/projects/groovy-pakistan-2024/groovy-group.png",
        "/images/projects/groovy-pakistan-2024/groovy-home-mobile.png",
        "/images/projects/groovy-pakistan-2024/pants.jpg",
        "/images/projects/groovy-pakistan-2024/shirts-cropped.png"
      ],
      "testimonial": {
        "content": "گرووی پاکستان کے ساتھ ان کی ای کامرس ڈویلپمنٹ پر کام کرنا ہماری ٹیم کے لیے ایک فائدہ مند تجربہ تھا۔ ہم نے ان کے برانڈ کے نظریات کو سمجھنے اور اسے ایک فعال اور بصری طور پر پرکشش آن لائن پلیٹ فارم میں ترجمہ کرنے پر توجہ مرکوز کی۔ ان کے وژن کو ڈیجیٹل طور پر زندہ ہوتے دیکھنا اور یہ جاننا کہ ہم نے ان کی آن لائن موجودگی قائم کرنے میں ایک اہم کردار ادا کیا ہے، یہ ایسی چیز ہے جس پر ہمیں فخر ہے۔",
        "author": "کبیر، دیگر ڈیو کے بانی"
      },
      "secondCover": "/images/projects/groovy-pakistan-2024/second-cover.png"
    }
  },
  {
    "id": "3",
    "title": "پارچہ81 کے لیے برانڈنگ اور ویب سائٹ ڈویلپمنٹ",
    "company": "پارچہ",
    "hasPage": true,
    "year": "2024",
    "description": "ویب سائٹ ڈیزائن، ڈویلپمنٹ اور برانڈنگ",
    "imageSrc": "/images/projects/parcheh81-2024/Parcheh.nyc_collections_all.webp",
    "url": "https://parcheh81.com/",
    "coverImage": "/images/projects/parcheh81-2024/Parcheh.nyc_collections_all.webp",
    "coverImageAlt": "پارچہ اسٹور کا آغاز",
    "page": {
      "excerpt": "پارچہ (فارسی میں 'کپڑا' کے لیے) کے ساتھ ہمارے تعاون کا مرکز اس کے نام کے مطابق ایک ڈیجیٹل تجربہ تخلیق کرنا تھا۔ ہم نے ان کے ٹیکسٹائلز کی منفرد ساخت، فنکاری اور کہانی کو ایک ایسے ٹیلرڈ ای کامرس پلیٹ فارم میں ترجمہ کیا جہاں کپڑے کی تفصیلات واقعی چمکتی ہیں۔ نتیجہ ایک شاندار اور انٹیوٹیو سائٹ ہے جو صارفین کو برانڈ کی دنیا میں غرق کرنے کا ایک سفر پیش کرتی ہے، جو ہماری صلاحیت کو ظاہر کرتی ہے کہ ہم پیچیدہ ڈیجیٹل ڈیزائن کے ذریعے برانڈ کے بنیادی جوہر کو کیسے پکڑ سکتے ہیں۔",
      "splitSections": [
        {
          "heading": "چیلنجز",
          "content": "پارچہ کے لیے، اہم چیلنجز میں ان کے کپڑوں کی عمدہ احساس کو ڈیجیٹل طور پر ظاہر کرنا اور ایک نفیس جمالیات کو انٹیوٹیو استعمال کے ساتھ متوازن کرنا شامل تھا۔ ہم نے اسے اعلیٰ ریزولیشن کی تصاویر، زوم کی خصوصیات اور متاثر کن تفصیلات کے ساتھ حل کیا، جبکہ ایک صارف انٹرفیس/تجربہ کو واضح نیویگیشن اور سٹریم لائنڈ چیک آؤٹ کے ساتھ شامل کیا۔ اہم بات یہ ہے کہ، ہم نے پارچہ کی برانڈ کہانی اور کاریگری کے عزم کو سائٹ بھر میں مخصوص حصوں اور لطیف ڈیزائن اشاروں کا استعمال کرتے ہوئے شامل کیا، جس سے گاہک کے ساتھ ان کی ورثے اور معیار کے تعلق کو بڑھایا گیا۔",
          "tags": [
            "ٹیکسٹائل پر مبنی بصری حکمت عملی",
            "بصری شناخت",
            "شوپائف",
            "ثقافتی طور پر حساس UI/UX ڈیزائن",
            "اعلیٰ معیار کی مصنوعات کی پیشکش"
          ]
        },
        {
          "heading": "تحریک",
          "content": "کپڑے پارچہ سے گہری تحریک لیتے ہوئے، ہمارا ڈیزائن اس کی چھونے والی دولت اور معیار کو ڈیجیٹل دائرے میں ترجمہ کرنے پر مرکوز تھا۔ ہم نے زمانہ ساز کاریگری اور جدید شان و شوکت کو یکجا کرنے کا ارادہ کیا، ایک انٹیمیٹ، گیلری جیسا آن لائن تجربہ تخلیق کیا۔ اعلیٰ معیار کی بصریات اور صاف، سوچ سمجھ کر ترتیب دی گئی لے آؤٹ کلیدی تھے، جو برانڈ کی منفرد فنکاری اور ورثے کے بارے میں سوچ بچار کے ساتھ دریافت کو فروغ دیتے تھے۔"
        }
      ],
      "upperSlideshow": [
        "/images/projects/parcheh81-2024/parcheh-home-mobile.png",
        "/images/projects/parcheh81-2024/parcheh-menu-mobile.png",
        "/images/projects/parcheh81-2024/parcheh-logo-gridded.png",
        "/images/projects/parcheh81-2024/girl-standing-square.png"
      ],
      "testimonial": {
        "content": "دیگر ڈیو کے ساتھ کام کرنے سے پارچہ تبدیل ہو گیا۔ ویب اور برانڈنگ کی ان کی مشترکہ مہارت نے ہماری توقعات سے کہیں زیادہ نتائج فراہم کیے۔ صارف دوست سائٹ نے فروخت میں ڈرامائی اضافہ کیا، نفیس برانڈنگ ہماری شناخت کو عین عکاسی کرتی ہے اور اب ہر جگہ استعمال ہوتی ہے۔ ہم دیگر ڈیو کو کسی بھی برانڈ کو سفارش کرتے ہیں جسے مؤثر ڈیجیٹل نتائج کی ضرورت ہو۔",
        "author": "ناصر، پارچہ کے بانی"
      },
      "secondCover": "https://images.unsplash.com/photo-1509114397022-ed747cca3f65?q=80&w=1935&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "6",
    "title": "ٹائنی فٹ پرنٹ کافی کے لیے ادائیگی کا انفراسٹرکچر منتقلی",
    "year": "2024",
    "description": "ویب سائٹ ڈیزائن، ریچارج منتقلی اور شوپائف تھیم ڈویلپمنٹ",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/tinyfootprintcoffee.webp",
    "url": "/blog/dc423a1a-f68e-42bd-a9b3-430bd57f82c1"
  },
  {
    "id": "7",
    "title": "نیوبی کے ٹیلرز کے لیے ویب سائٹ ڈویلپمنٹ اور برانڈنگ",
    "year": "2023",
    "description": "ڈیزائن، ہیڈلیس شوپائف ڈیپلائمنٹ، مارکیٹنگ اور ویب سائٹ ڈویلپمنٹ",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/neubees.webp"
  },
  {
    "id": "8",
    "title": "ایک قدم اور کے لیے انٹرپرائز انفراسٹرکچر ڈویلپمنٹ",
    "year": "2023",
    "description": "ویب سائٹ ڈیزائن، ویب سائٹ ڈویلپمنٹ اور انفراسٹرکچر",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/ekqadamaur.webp",
    "url": "http://ekqadamaur.kabeers.network/"
  }
]
