[
  {
    "id": "4",
    "title": "وش کے لیے برانڈنگ اور ویب سائٹ کی تیاری",
    "company": "وش",
    "hasPage": true,
    "year": "2025",
    "description": "ویب سائٹ ڈیزائن، تیاری اور برانڈنگ",
    "imageSrc": "/images/projects/wish-2024/wishapparels.com_.webp",
    "url": "https://wishapparels.com/",
    "coverImage": "/images/projects/wish-2024/wishapparels.com_.webp",
    "coverImageAlt": "وش سٹور کا آغاز",
    "page": {
      "excerpt": "وش اپیرلز کے ساتھ ہمارے تعاون میں ایک ایسا ڈیجیٹل تجربہ تیار کرنا شامل تھا جو ان کی آنے والی ملبوسات کی لائن کے معیار اور انداز کی عکاسی کرتا ہے۔ ہم نے ایک بدیہی ای کامرس پلیٹ فارم ڈیزائن کیا جو نہ صرف ان کی مصنوعات کو اعلیٰ معیار کی بصری اور تفصیلی معلومات کے ساتھ پیش کرتا ہے بلکہ ایک ہموار اور محفوظ خریداری کا سفر بھی فراہم کرتا ہے۔ برانڈنگ اور ڈیزائن کے عناصر، جو ویب سائٹ کے ساتھ مل کر احتیاط سے تیار کیے گئے ہیں، برانڈ کے اخلاق کو پہنچانے اور ان کی ہدف شدہ سامعین کو راغب کرنے کے لیے ہم آہنگی کے ساتھ کام کرتے ہیں۔ یہ پروجیکٹ ہماری ایجنسی کے اختراعی کاروباروں کے لیے موثر ڈیجیٹل حل تیار کرنے کے عزم کو اجاگر کرتا ہے جو برانڈ کی ترقی اور صارفین کی مصروفیت کو بڑھاتے ہیں۔",
      "splitSections": [
        {
          "heading": "چیلنجز",
          "content": "ایک نئی برانڈ شناخت قائم کرنا: چونکہ وش اپیرلز مارکیٹ میں ایک نیا داخل ہونے والا تھا، اس لیے ایک اہم چیلنج شروع سے ہی ایک واضح اور یادگار برانڈ شناخت بنانا تھا۔ اس میں ایک ایسی بصری زبان تیار کرنا شامل تھی جو ان کی ہدف شدہ آبادی کے ساتھ مطابقت رکھتی ہو اور لوگو ڈیزائن، ٹائپوگرافی، رنگوں کے پیلیٹ اور مجموعی جمالیات کے ذریعے ان کی برانڈ اقدار کو مؤثر طریقے سے پہنچائے۔ ایک قابل توسیع ای کامرس پلیٹ فارم بنانا: ہمیں ایک ای کامرس ویب سائٹ تیار کرنے کی ضرورت تھی جو نہ صرف بصری طور پر دلکش اور صارف دوست ہو بلکہ مصنوعات کی پیشکش اور صارفین کی ٹریفک میں مستقبل کی ترقی کو ایڈجسٹ کرنے کے لیے مضبوط اور قابل توسیع بھی ہو۔ ضروری خصوصیات جیسے پروڈکٹ براؤزنگ، محفوظ چیک آؤٹ، اور انوینٹری مینجمنٹ کا ہموار انضمام بہت ضروری تھا۔",
          "tags": ["برانڈ کی تیاری", "بصری شناخت", "Shopify", "UI/UX ڈیزائن"]
        },
        {
          "heading": "الہام",
          "content": "کم سے کم خوبصورتی: ڈیزائن کی سمت کم سے کم خوبصورتی کی خواہش سے بہت زیادہ متاثر تھی، جس سے ملبوسات خود مرکزیت حاصل کر سکیں۔ صاف ستھری لکیریں، کافی سفید جگہ، اور نفیس ٹائپوگرافی کو کم تر عیش و عشرت اور لازوال انداز کا احساس پیدا کرنے کے لیے استعمال کیا گیا۔ بصری کہانی سنانے پر توجہ: فیشن میں بصری کشش کی اہمیت کو تسلیم کرتے ہوئے، ہم نے ایک ایسا پلیٹ فارم بنانے پر توجہ مرکوز کی جس نے اعلیٰ معیار کی تصاویر اور دلکش بصری کہانی سنانے کو ترجیح دی۔ ویب سائٹ ڈیزائن کا مقصد صارفین کو برانڈ کی دنیا میں غرق کرنا اور ملبوسات کو ایک پرجوش اور دل چسپ انداز میں پیش کرنا تھا۔"
        }
      ],
      "upperSlideshow": [
        "/images/projects/wish-2024/upper-slideshow-1.webp",
        "/images/projects/wish-2024/1743813808292_100.webp",
        "/images/projects/wish-2024/wish-girl-11.webp",
        "/images/projects/wish-2024/wish-boy-1.webp",
        "/images/projects/wish-2024/wish-logo.webp",
        "/images/projects/wish-2024/with-other-dev.webp"
      ],
      "testimonial": {
        "content": "آدر ڈیولپمنٹ کے ساتھ کام کرنا وش اپیرلز کے لیے ایک گیم چینجر ثابت ہوا۔ ویب سائٹ کی تیاری اور برانڈنگ کے لیے ان کے جامع انداز نے ہماری توقعات سے کہیں زیادہ نتائج دیے۔ نئی ویب سائٹ کا صارف دوست ڈیزائن اور دل چسپ پیشکش نے براہ راست فروخت میں ناقابل یقین 500% اضافے میں اہم کردار ادا کیا۔ ان کی تیار کردہ برانڈنگ نفیس، یادگار اور ہماری برانڈ شناخت کی بالکل عکاسی کرتی ہے، جسے ہم نے اپنے کاروبار کے تمام پہلوؤں میں فخر سے اپنایا ہے۔ ہم کسی بھی ابھرتے ہوئے برانڈ کو جو موثر ڈیجیٹل حل تلاش کر رہا ہے، آدر ڈیولپمنٹ کی پرزور سفارش کرتے ہیں۔",
        "author": "طلحہ، بانی وش"
      },
      "secondCover": "https://images.unsplash.com/photo-1509114397022-ed747cca3f65?q=80&w=1935&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "1",
    "title": "نارکنز بلڈرز کے لیے ویب سائٹ انفراسٹرکچر کی تخلیق",
    "company": "نارکنز",
    "hasPage": true,
    "year": "2025",
    "description": "ویب سائٹ ڈیزائن، تیاری اور انفراسٹرکچر",
    "imageSrc": "/images/projects/narkins-2025/narkinsbuilders.com_.webp",
    "url": "/blog/fdc784b9-2f1d-43a2-8919-658ec1901491",
    "coverImage": "/images/projects/narkins-2025/narkinsbuilders.com_.webp",
    "coverImageAlt": "نارکنز بلڈرز کی ویب سائٹ کا آغاز",
    "page": {
      "excerpt": "ہم نے نارکنز بلڈرز، ایک معروف تعمیراتی کمپنی، کے ساتھ ان کی آن لائن موجودگی کی بنیاد بنانے کے لیے ایک مضبوط اور قابل توسیع ویب سائٹ انفراسٹرکچر تیار کرنے کے لیے شراکت داری کی۔ اس پروجیکٹ میں ان کے تعمیراتی منصوبوں کے پورٹ فولیو کو ظاہر کرنے، ان کی خدمات کے بارے میں تفصیلی معلومات فراہم کرنے اور کلائنٹ کی پوچھ گچھ میں سہولت فراہم کرنے کے لیے ایک صارف دوست پلیٹ فارم ڈیزائن اور تیار کرنا شامل تھا۔ ہماری توجہ ایک قابل اعتماد اور موثر نظام کی تعمیر پر تھی جو نارکنز بلڈرز کی ترقی کی حمایت کرے اور اسٹیک ہولڈرز کے ساتھ ان کے ڈیجیٹل مواصلات کو بہتر بنائے۔",
      "splitSections": [
        {
          "heading": "چیلنجز",
          "content": "ایک قابل توسیع انفراسٹرکچر تیار کرنا: نارکنز بلڈرز کو ایک ایسی ویب سائٹ انفراسٹرکچر کی ضرورت تھی جو تصاویر، منصوبوں اور تکنیکی خصوصیات سمیت منصوبے کے ڈیٹا کی ایک بڑی مقدار کو سنبھال سکے۔ ہمیں ایک ایسا نظام ڈیزائن کرنے کی ضرورت تھی جو اس معلومات کو مؤثر طریقے سے منظم اور ڈسپلے کر سکے اور ساتھ ہی ویب سائٹ کی بہترین کارکردگی کو یقینی بنائے۔ پروجیکٹ مینجمنٹ ٹولز کو ضم کرنا: کلائنٹ کے مواصلات اور پروجیکٹ کی تازہ کاریوں کو ہموار کرنے کے لیے، ہم نے ویب سائٹ میں پروجیکٹ مینجمنٹ ٹولز کو ضم کیا، جس سے ہموار تعامل اور معلومات کا تبادلہ ممکن ہوا۔ اس کے لیے مطابقت اور سیکیورٹی کو یقینی بنانے کے لیے محتاط منصوبہ بندی اور عمل درآمد کی ضرورت تھی۔ ڈیٹا کی سیکیورٹی اور قابل اعتمادی کو یقینی بنانا: تعمیراتی ڈیٹا کی حساس نوعیت، بشمول معاہدے اور بلیو پرنٹس، کے پیش نظر، مضبوط ڈیٹا سیکیورٹی اور سسٹم کی قابل اعتمادی کو یقینی بنانا سب سے اہم تھا۔ ہم نے ڈیٹا کے نقصان اور غیر مجاز رسائی سے بچانے کے لیے صنعت کے معیاری حفاظتی اقدامات اور بیک اپ پروٹوکول نافذ کیے ہیں۔",
          "tags": [
            "ویب ڈیولپمنٹ",
            "انفراسٹرکچر",
            "ڈیٹا بیس ڈیزائن",
            "API انٹیگریشن",
            "پراجیکٹ مینجمنٹ ٹولز",
            "ڈیٹا سیکیورٹی"
          ]
        },
        {
          "heading": "ہمارا طریقہ کار",
          "content": "ماڈیولر ڈیزائن اور ڈیولپمنٹ: ہم نے ایک ماڈیولر ڈیزائن اور ڈیولپمنٹ اپروچ اختیار کی، جو نارکنز بلڈرز کی ضروریات کے ارتقاء کے ساتھ لچک اور توسیع پذیری کی اجازت دیتی ہے۔ اس میں دوبارہ قابل استعمال اجزاء اور ایک اچھی طرح سے منظم کوڈ بیس بنانا شامل تھا۔ مواد کے انتظام کے نظام (CMS) کا نفاذ: ہم نے ایک صارف دوست CMS نافذ کیا، جس سے نارکنز بلڈرز کو بغیر کسی وسیع تکنیکی مہارت کی ضرورت کے ویب سائٹ کے مواد کو آسانی سے اپ ڈیٹ کرنے، نئے پروجیکٹس شامل کرنے اور کلائنٹ کی پوچھ گچھ کا انتظام کرنے کی طاقت ملی۔ کارکردگی کی اصلاح: ہم نے تمام آلات پر تیز لوڈنگ اوقات اور ایک ہموار صارف کے تجربے کو یقینی بنانے کے لیے ویب سائٹ کی کارکردگی کو بہتر بنانے پر توجہ مرکوز کی۔ اس میں امیج آپٹیمائزیشن، کیشنگ کی حکمت عملی اور موثر کوڈ پر عمل درآمد شامل تھا۔",
          "tags": [
            "CMS (مثلاً ورڈپریس، ڈروپل)",
            "کارکردگی کی اصلاح",
            "رسپانسیو ڈیزائن",
            "ماڈیولر ڈیزائن",
            "صارف کا تجربہ (UX)",
            "مواد کا انتظام"
          ]
        }
      ],
      "upperSlideshow": [
        "/images/projects/narkins-2025/narkins-collage.webp",
        "/images/projects/narkins-2025/1743813250549_100.webp",
        "/images/projects/narkins-2025/hcr_new.webp"
      ],
      "testimonial": {
        "content": "دی ادر ڈیولپمنٹ نے ہمیں ایک ویب سائٹ انفراسٹرکچر فراہم کیا ہے جس نے ہمارے آن لائن کاموں کو نمایاں طور پر بہتر بنایا ہے۔ پیچیدہ ڈیٹا کو سنبھالنے اور اہم ٹولز کو ضم کرنے میں ان کی ٹیم کی مہارت نے ہمارے پروجیکٹ مینجمنٹ کو ہموار کیا ہے اور کلائنٹس کے ساتھ ہمارے مواصلات کو بہتر بنایا ہے۔ ویب سائٹ مضبوط، صارف دوست ہے اور اس نے ہمیں اپنے کام کو مؤثر طریقے سے پیش کرنے کے قابل بنایا ہے۔ ہم دی ادر ڈیولپمنٹ کی پیشہ ورانہ مہارت اور اعلیٰ معیار کا حل فراہم کرنے کے عزم کی تعریف کرتے ہیں۔",
        "author": "سریم"
      },
      "secondCover": "https://images.unsplash.com/photo-1553877522-43269d4ea984?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "3",
    "title": "پارچہ 81 کے لیے ویب سائٹ کی تیاری اور برانڈنگ",
    "year": "2024",
    "description": "ویب سائٹ کی تیاری اور ڈیزائن",
    "imageSrc": "/images/projects/parcheh81-2024/parcheh81.com_.webp"
  },
  {
    "id": "5",
    "title": "گرووی پاکستان کے لیے ویب سائٹ کی تخلیق",
    "year": "2024",
    "description": "Shopify تھیم کی تیاری، ویب سائٹ کی تیاری اور آغاز",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/groovy-layers.webp"
  },
  {
    "id": "6",
    "title": "ٹائنی فٹ پرنٹ کافی کے لیے ادائیگی کے انفراسٹرکچر کی منتقلی",
    "year": "2024",
    "description": "ویب سائٹ ڈیزائن، ریچارج کی منتقلی اور Shopify تھیم کی تیاری",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/tinyfootprintcoffee.webp",
    "url": "/blog/dc423a1a-f68e-42bd-a9b3-430bd57f82c1"
  },
  {
    "id": "7",
    "title": "نیوبیز ٹیلرز کے لیے ویب سائٹ کی تیاری اور برانڈنگ",
    "year": "2023",
    "description": "ڈیزائن، ہیڈ لیس Shopify تعیناتی، مارکیٹنگ اور ویب سائٹ کی تیاری",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/neubees.webp"
  },
  {
    "id": "8",
    "title": "ایک قدم اور کے لیے انٹرپرائز انفراسٹرکچر کی تیاری",
    "year": "2023",
    "description": "ویب سائٹ ڈیزائن، ویب سائٹ کی تیاری اور انفراسٹرکچر",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/ekqadamaur.webp",
    "url": "http://ekqadamaur.kabeers.network/"
  }
]