[
  {
    "id": "4",
    "title": "Branding & Website-Entwicklung für Wish",
    "company": "Wish",
    "hasPage": true,
    "year": "2025",
    "description": "Website-Design, Entwicklung & Branding",
    "imageSrc": "/images/projects/wish-2024/wishapparels.com_.webp",
    "url": "https://wishapparels.com/",
    "coverImage": "/images/projects/wish-2024/wishapparels.com_.webp",
    "coverImageAlt": "Wish Store Launch",
    "page": {
      "excerpt": "Unsere Zusammenarbeit mit Wish Apparels umfasste die Gestaltung eines digitalen Erlebnisses, das die Qualität und den Stil ihrer kommenden Bekleidungslinie widerspiegelt. Wir haben eine intuitive E-Commerce-Plattform entworfen, die nicht nur ihre Produkte mit hochwertigen Bildern und detaillierten Informationen präsentiert, sondern auch ein nahtloses und sicheres Einkaufserlebnis bietet. Die Branding- und Designelemente, die in enger Abstimmung mit der Website entwickelt wurden, arbeiten harmonisch zusammen, um das Markenethos zu kommunizieren und ihre Zielgruppe anzusprechen. Dieses Projekt unterstreicht das Engagement unserer Agentur, wirkungsvolle digitale Lösungen zu schaffen, die das Markenwachstum und die Kundenbindung für innovative Unternehmen fördern.",
      "splitSections": [
        {
          "heading": "Herausforderungen",
          "content": "Etablierung einer neuen Markenidentität: Da Wish Apparels ein neuer Marktteilnehmer war, bestand eine zentrale Herausforderung darin, von Grund auf eine unverwechselbare und einprägsame Markenidentität zu schaffen. Dies umfasste die Entwicklung einer visuellen Sprache, die bei ihrer Zielgruppe Anklang fand und ihre Markenwerte durch Logodesign, Typografie, Farbpaletten und die allgemeine Ästhetik effektiv kommunizierte. Aufbau einer skalierbaren E-Commerce-Plattform: Wir mussten eine E-Commerce-Website entwickeln, die nicht nur optisch ansprechend und benutzerfreundlich war, sondern auch robust und skalierbar, um zukünftiges Wachstum im Produktangebot und Kundenverkehr zu bewältigen. Die nahtlose Integration wesentlicher Funktionen wie Produktsuche, sichere Kasse und Bestandsverwaltung war entscheidend.",
          "tags": ["Markenentwicklung", "Visuelle Identität", "Shopify", "UI/UX Design"]
        },
        {
          "heading": "Inspiration",
          "content": "Minimalistische Eleganz: Die Designrichtung war stark von dem Wunsch nach minimalistischer Eleganz inspiriert, wodurch die Bekleidung selbst in den Mittelpunkt rücken konnte. Klare Linien, viel Freiraum und eine anspruchsvolle Typografie wurden eingesetzt, um ein Gefühl von unaufdringlichem Luxus und zeitlosem Stil zu schaffen. Fokus auf visuelles Storytelling: Die Bedeutung der visuellen Anziehungskraft in der Mode erkennend, konzentrierten wir uns auf die Schaffung einer Plattform, die hochwertige Bilder und überzeugendes visuelles Storytelling in den Vordergrund stellte. Das Website-Design zielte darauf ab, die Nutzer in die Welt der Marke einzutauchen und die Kleidungsstücke auf eine ansprechende und inspirierende Weise zu präsentieren."
        }
      ],
      "upperSlideshow": [
        "/images/projects/wish-2024/upper-slideshow-1.webp",
        "/images/projects/wish-2024/1743813808292_100.webp",
        "/images/projects/wish-2024/wish-girl-11.webp",
        "/images/projects/wish-2024/wish-boy-1.webp",
        "/images/projects/wish-2024/wish-logo.webp",
        "/images/projects/wish-2024/with-other-dev.webp"
      ],
      "testimonial": {
        "content": "Die Zusammenarbeit mit Other Dev war ein Wendepunkt für Wish Apparels. Ihr ganzheitlicher Ansatz in der Website-Entwicklung und im Branding lieferte Ergebnisse, die unsere Erwartungen weit übertrafen. Das benutzerfreundliche Design und die überzeugende Präsentation der neuen Website trugen direkt zu einem unglaublichen Umsatzanstieg von 500 % bei. Das von ihnen entwickelte Branding ist anspruchsvoll, einprägsam und spiegelt unsere Markenidentität perfekt wider, die wir mit Stolz in allen Bereichen unseres Unternehmens übernommen haben. Wir empfehlen Other Dev jedem aufstrebenden Unternehmen, das nach wirkungsvollen digitalen Lösungen sucht, wärmstens.",
        "author": "Talha, Gründer von Wish"
      },
      "secondCover": "https://images.unsplash.com/photo-1509114397022-ed747cca3f65?q=80&w=1935&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "1",
    "title": "Erstellung der Website-Infrastruktur für Narkins Builders",
    "company": "Narkins",
    "hasPage": true,
    "year": "2025",
    "description": "Website-Design, Entwicklung & Infrastruktur",
    "imageSrc": "/images/projects/narkins-2025/narkinsbuilders.com_.webp",
    "url": "/blog/fdc784b9-2f1d-43a2-8919-658ec1901491",
    "coverImage": "/images/projects/narkins-2025/narkinsbuilders.com_.webp",
    "coverImageAlt": "Narkins Builders Website Launch",
    "page": {
      "excerpt": "Wir haben mit Narkins Builders, einem führenden Bauunternehmen, zusammengearbeitet, um eine robuste und skalierbare Website-Infrastruktur zu schaffen, die das Fundament ihrer Online-Präsenz bildet. Dieses Projekt umfasste das Design und die Entwicklung einer benutzerfreundlichen Plattform zur Präsentation ihres Portfolios an Bauprojekten, zur Bereitstellung detaillierter Informationen über ihre Dienstleistungen und zur Erleichterung von Kundenanfragen. Unser Fokus lag auf dem Aufbau eines zuverlässigen und effizienten Systems, das das Wachstum von Narkins Builders unterstützt und ihre digitale Kommunikation mit Stakeholdern verbessert.",
      "splitSections": [
        {
          "heading": "Herausforderungen",
          "content": "Entwicklung einer skalierbaren Infrastruktur: Narkins Builders benötigte eine Website-Infrastruktur, die ein großes Volumen an Projektdaten, einschließlich Bildern, Plänen und technischen Spezifikationen, verarbeiten konnte. Wir mussten ein System entwerfen, das diese Informationen effizient verwalten und anzeigen konnte und gleichzeitig eine optimale Website-Performance gewährleistete. Integration von Projektmanagement-Tools: Um die Kundenkommunikation und Projekt-Updates zu optimieren, haben wir Projektmanagement-Tools in die Website integriert, die eine nahtlose Interaktion und den Informationsaustausch ermöglichen. Dies erforderte eine sorgfältige Planung und Implementierung, um Kompatibilität und Sicherheit zu gewährleisten. Gewährleistung von Datensicherheit und Zuverlässigkeit: Angesichts der sensiblen Natur von Baudaten, einschließlich Verträgen und Bauplänen, war die Gewährleistung einer robusten Datensicherheit und Systemzuverlässigkeit von größter Bedeutung. Wir haben branchenübliche Sicherheitsmaßnahmen und Backup-Protokolle implementiert, um Datenverlust und unbefugten Zugriff zu verhindern.",
          "tags": [
            "Webentwicklung",
            "Infrastruktur",
            "Datenbankdesign",
            "API-Integration",
            "Projektmanagement-Tools",
            "Datensicherheit"
          ]
        },
        {
          "heading": "Unser Ansatz",
          "content": "Modulares Design und Entwicklung: Wir haben einen modularen Design- und Entwicklungsansatz gewählt, der Flexibilität und Skalierbarkeit ermöglicht, wenn sich die Bedürfnisse von Narkins Builders weiterentwickeln. Dies umfasste die Erstellung wiederverwendbarer Komponenten und einer gut strukturierten Codebasis. Implementierung eines Content-Management-Systems (CMS): Wir haben ein benutzerfreundliches CMS implementiert, das Narkins Builders in die Lage versetzt, Website-Inhalte einfach zu aktualisieren, neue Projekte hinzuzufügen und Kundenanfragen zu verwalten, ohne umfangreiche technische Kenntnisse zu benötigen. Performance-Optimierung: Wir haben uns auf die Optimierung der Website-Performance konzentriert, um schnelle Ladezeiten und eine reibungslose Benutzererfahrung auf allen Geräten zu gewährleisten. Dies umfasste Bildoptimierung, Caching-Strategien und effiziente Codeausführung.",
          "tags": [
            "CMS (z.B. WordPress, Drupal)",
            "Performance-Optimierung",
            "Responsives Design",
            "Modulares Design",
            "User Experience (UX)",
            "Content Management"
          ]
        }
      ],
      "upperSlideshow": [
        "/images/projects/narkins-2025/narkins-collage.webp",
        "/images/projects/narkins-2025/1743813250549_100.webp",
        "/images/projects/narkins-2025/hcr_new.webp"
      ],
      "testimonial": {
        "content": "The Other Dev hat uns eine Website-Infrastruktur bereitgestellt, die unsere Online-Abläufe erheblich verbessert hat. Die Expertise ihres Teams im Umgang mit komplexen Daten und der Integration wichtiger Tools hat unser Projektmanagement optimiert und unsere Kommunikation mit Kunden verbessert. Die Website ist robust, benutzerfreundlich und hat es uns ermöglicht, unsere Arbeit effektiv zu präsentieren. Wir schätzen die Professionalität und das Engagement von The Other Dev bei der Bereitstellung einer hochwertigen Lösung.",
        "author": "Sarim"
      },
      "secondCover": "https://images.unsplash.com/photo-1553877522-43269d4ea984?q=80&w=2070&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D"
    }
  },
  {
    "id": "54",
    "title": "Branding & SaaS-Plattform-Entwicklung für Finlit",
    "company": "Finlit",
    "hasPage": true,
    "year": "2025",
    "description": "End-to-End Design, Website-/SAAS-Entwicklung & Branding.",
    "imageSrc": "/images/projects/finlit-2025/finlit.deployments.otherdev.com_.png",
    "url": "https://finlit.deployments.otherdev.com/",
    "coverImage": "/images/projects/finlit-2025/finlit.deployments.otherdev.com_.png",
    "coverImageAlt": "Finlit SaaS Platform Interface",
    "page": {
      "excerpt": "Unsere Zusammenarbeit mit Finlit umfasste die umfassende Erstellung ihrer SaaS-Plattform, vom anfänglichen Branding und der visuellen Identität bis zur Full-Stack-Entwicklung einer intuitiven und ansprechenden Lernanwendung. Unser Fokus lag auf der Bereitstellung eines minimalistischen, aber wirkungsvollen digitalen Erlebnisses, das es den Nutzern ermöglicht, sich selbstbewusst in der Welt der Finanzen zurechtzufinden.",
      "splitSections": [
        {
          "heading": "Projektziele",
          "content": "Die Kernziele für Finlit waren der Aufbau einer starken und vertrauenswürdigen Markenpräsenz und die Entwicklung einer benutzerfreundlichen SaaS-Plattform, die komplexe Finanzkonzepte entmystifiziert. Dies umfasste die Gestaltung einer klaren visuellen Identität, einschließlich Logodesign und Markenrichtlinien, sowie den Aufbau einer skalierbaren Webanwendung mit interaktiven Lernmodulen, Fortschrittsverfolgung und einer nahtlosen Benutzererfahrung. Unser Ziel war es, eine Plattform zu schaffen, die sowohl zugänglich als auch maßgeblich wirkt und die Nutzer dazu anregt, sich aktiv mit der Finanzbildung auseinanderzusetzen.",
          "tags": [
            "SaaS-Plattform-Entwicklung",
            "Branding-Strategie",
            "Logodesign",
            "UI/UX Design",
            "E-Learning-Entwicklung",
            "Finanzkompetenz"
          ]
        },
        {
          "heading": "Branding & Visuelle Identität",
          "content": "Für Finlit entwickelten wir eine Markenidentität, die auf Klarheit und Zugänglichkeit basiert. Das minimalistische und klare Logodesign wurde so gestaltet, dass es sowohl einprägsam ist als auch die Mission der Plattform widerspiegelt, Finanzen zu vereinfachen. Wir etablierten eine klare und moderne Farbpalette und ein Typografiesystem, das Vertrauen und Verständlichkeit vermittelt. Diese Branding-Elemente wurden sorgfältig in das Design der SaaS-Plattform integriert, um ein kohärentes und professionelles Benutzererlebnis über alle Kontaktpunkte hinweg zu gewährleisten.",
          "tags": [
            "Markenidentität",
            "Logodesign",
            "Farbpalette",
            "Typografie",
            "Visuelle Richtlinien"
          ]
        },
        {
          "heading": "SaaS-Plattform-Entwicklung",
          "content": "Die Entwicklung der Finlit SaaS-Plattform konzentrierte sich auf die Schaffung einer ansprechenden und effektiven Lernumgebung. Wir entwickelten eine skalierbare Webanwendung mit strukturierten Kursen, interaktiven Lektionen, Quizfragen und Fortschrittsverfolgungsmechanismen. Die Benutzeroberfläche wurde mit einer minimalistischen Ästhetik gestaltet, um Inhalte zu priorisieren und Ablenkungen zu minimieren, wodurch ein fokussiertes Lernerlebnis gewährleistet wird. Wir legten großen Wert auf den Benutzerfluss und die Navigation, um einen intuitiven und angenehmen Weg für die Nutzer zu schaffen, ihr Finanzwissen aufzubauen. Die Plattform wurde mit Astro und Next.js entwickelt und auf Vercel bereitgestellt, wobei der Fokus auf Leistung und Skalierbarkeit lag, um einer wachsenden Nutzerbasis und einer erweiterten Inhaltsbibliothek gerecht zu werden.",
          "tags": [
            "Full-Stack-Entwicklung",
            "SaaS-Architektur",
            "E-Learning-Plattform-Entwicklung",
            "Interaktiver Inhalt",
            "Benutzerfortschrittsverfolgung",
            "Skalierbarkeit"
          ]
        },
        {
          "heading": "Design & Benutzererfahrung",
          "content": "Unsere Designphilosophie für Finlit priorisierte Klarheit und Benutzerfreundlichkeit. Wir entschieden uns für eine minimalistische Ästhetik mit viel Weißraum und klarer Typografie, um die Lesbarkeit zu verbessern und die kognitive Belastung zu reduzieren. Die Benutzeroberfläche wurde intuitiv und konsistent gestaltet, sodass die Nutzer problemlos durch die Plattform navigieren können. Wir konzentrierten uns auf die Schaffung eines nahtlosen Lernflusses, der sicherstellt, dass die Nutzer einfach auf Kursmaterialien zugreifen, ihren Fortschritt verfolgen und mit interaktiven Elementen interagieren können. Unser Ziel war es, eine digitale Lernumgebung zu schaffen, die sowohl professionell als auch zugänglich wirkt und die Finanzbildung für jeden zugänglich macht.",
          "tags": [
            "Minimalistisches Design",
            "User Experience (UX)",
            "User Interface (UI)",
            "Informationsarchitektur",
            "Benutzerfreundlichkeit",
            "Barrierefreiheit"
          ]
        }
      ],
      "upperSlideshow": [
        "/images/projects/finlit-2025/finlit-group.png",
        "/images/projects/finlit-2025/finlit-home-mobile.png",
        "/images/projects/finlit-2025/team-groupchat.png",
        "/images/projects/finlit-2025/finlit-courses-macbook.png",
        "/images/projects/finlit-2025/finlit-logo.png",
        "/images/projects/finlit-2025/finlit.deployments.otherdev.com_trading_1x1.png"
      ],
      "testimonial": {
        "content": "Die Entwicklung von Finlit von Grund auf war ein aufregendes und lohnendes Projekt für unser Team bei Other Dev. Wir stellten uns der Herausforderung, eine umfassende SaaS-Plattform zu schaffen, die Finanzkompetenz durch durchdachtes Branding und intuitives Design vereinfacht. Zu sehen, wie Finlit Einzelpersonen befähigt, ihre finanzielle Zukunft selbst in die Hand zu nehmen, ist ein Beweis für die Leistungsfähigkeit gut umgesetzter digitaler Lösungen.",
        "author": "Kabeer, Gründer von Other Dev"
      },
      "secondCover": "https://images.unsplash.com/photo-1550565211-5608309e310e?q=80&w=1974&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDBfHx8fA%3D%3D"
    }
  },
  {
    "id": "5",
    "title": "Website-Entwicklung für Groovy Pakistan",
    "company": "Groovy",
    "hasPage": true,
    "year": "2024",
    "description": "Website-Entwicklung & Shopify-Integrationen",
    "imageSrc": "/images/projects/groovy-pakistan-2024/groovy-main.png",
    "url": "https://groovypakistan.com/",
    "coverImage": "/images/projects/groovy-pakistan-2024/groovy-main.png",
    "coverImageAlt": "Groovy Pakistan Online Storefront",
    "page": {
      "excerpt": "Der Kern unseres Engagements mit Groovy Pakistan war das strategische Design und die robuste Entwicklung ihrer E-Commerce-Website. Unser Ziel war es, einen digitalen Raum zu schaffen, der nicht nur den dynamischen Geist der Marke widerspiegelt, sondern den Kunden auch einen unkomplizierten und ansprechenden Weg bietet, ihre Produkte zu entdecken und zu kaufen.",
      "splitSections": [
        {
          "heading": "Arbeit",
          "content": "Unsere Arbeit mit Groovy Pakistan konzentrierte sich auf die Gestaltung eines digitalen Schaufensters, das die Energie und Zugänglichkeit ihrer Marke verkörpert. Wir entwickelten sorgfältig eine intuitive E-Commerce-Plattform (groovypakistan.com), die nicht nur ihre vielfältige Produktpalette durch überzeugende Bilder und umfassende Details präsentiert, sondern auch einen reibungslosen und sicheren Transaktionsprozess gewährleistet. Das Design und die Benutzererfahrung der Website wurden sorgfältig auf ihre Zielgruppe abgestimmt, um ein nahtloses Online-Einkaufserlebnis zu fördern. Dieses Projekt veranschaulicht das Engagement unseres Studios, wirkungsvolle digitale Infrastrukturen aufzubauen, die es Unternehmen ermöglichen, effektiv mit ihren Kunden in Kontakt zu treten und das Online-Wachstum voranzutreiben."
        },
        {
          "heading": "Entwicklung Herausforderungen",
          "content": "Für Groovy Pakistan bestand eine primäre Herausforderung darin, einen kohäsiven und effektiven Online-Verkaufskanal zu etablieren, der auf ihren vielfältigen Kundenstamm zugeschnitten ist. Dies umfasste die Erstellung einer Website, die sowohl optisch ansprechend als auch hochfunktionell ist und die Produktübersicht, die Auftragsverwaltung und sichere Zahlungen nahtlos abwickeln kann. Die Gewährleistung eines responsiven Designs, das auf verschiedenen Geräten einwandfrei funktioniert, war ebenfalls ein wichtiger Aspekt, um ihre breite Zielgruppe zu erreichen. Darüber hinaus musste die Plattform skalierbar sein, um ihrem wachsenden Produktkatalog und dem steigenden Kundenverkehr gerecht zu werden.",
          "tags": [
            "E-Commerce-Plattform-Entwicklung",
            "User Experience (UX) Design",
            "Responsives Webdesign",
            "Skalierbare Architektur",
            "Zahlungs-Gateway-Integration"
          ]
        },
        {
          "heading": "Unsere Website-Lösung",
          "content": "Unser Ansatz konzentrierte sich auf den Aufbau eines nutzerzentrierten E-Commerce-Erlebnisses für Groovy Pakistan. Wir priorisierten eine klare Navigation, intuitive Such- und Filterfunktionen sowie visuell ansprechende Produktpräsentationen, um es den Kunden zu ermöglichen, die Angebote einfach zu finden und zu schätzen. Der Checkout-Prozess wurde so reibungslos und sicher wie möglich gestaltet, um Reibungsverluste zu minimieren und Conversions zu fördern. Der zugrunde liegende Technologie-Stack wurde aufgrund seiner Zuverlässigkeit und Skalierbarkeit ausgewählt, um eine robuste Plattform zu gewährleisten, die das Wachstum von Groovy Pakistan im Online-Marktplatz unterstützt. Wir konzentrierten uns darauf, eine digitale Umgebung zu schaffen, die für ihre Kunden sowohl zugänglich als auch vertrauenswürdig ist."
        },
        {
          "heading": "Wichtige Website-Funktionen",
          "content": "Die Groovy Pakistan Website (groovypakistan.com) umfasst eine Reihe von Funktionen, die speziell zur Verbesserung des Online-Einkaufserlebnisses entwickelt wurden. Dazu gehören detaillierte Produktseiten mit hochauflösenden Bildern und umfassenden Beschreibungen, ein robustes Such- und Filtersystem zur einfachen Navigation durch ihren Katalog, sichere Benutzerkonten zur Auftragsverfolgung und gespeicherten Informationen, ein unkomplizierter Warenkorb- und Checkout-Prozess mit mehreren Zahlungsoptionen sowie integrierte Kundensupport-Kanäle. Jedes Element wurde mit Fokus auf Benutzerfreundlichkeit und Effizienz implementiert, mit dem Ziel, eine positive und nahtlose Reise für die Online-Käufer von Groovy Pakistan zu schaffen.",
          "tags": [
            "Produktpräsentationen",
            "Erweiterte Suche & Filterung",
            "Benutzerkontenverwaltung",
            "Vereinfachter Checkout",
            "Zahlungsintegration",
            "Kundensupport-Funktionen"
          ]
        }
      ],
      "upperSlideshow": [
        "/images/projects/groovy-pakistan-2024/groovy-group.png",
        "/images/projects/groovy-pakistan-2024/groovy-home-mobile.png",
        "/images/projects/groovy-pakistan-2024/pants.jpg",
        "/images/projects/groovy-pakistan-2024/shirts-cropped.png"
      ],
      "testimonial": {
        "content": "Die Zusammenarbeit mit Groovy Pakistan bei der Entwicklung ihres E-Commerce war eine lohnende Erfahrung für unser Team bei Other Dev. Wir haben uns darauf konzentriert, ihr Markenethos zu verstehen und in eine funktionale und visuell ansprechende Online-Plattform zu übersetzen. Zu sehen, wie ihre Vision digital zum Leben erweckt wurde und zu wissen, dass wir eine Schlüsselrolle bei der Etablierung ihrer Online-Präsenz gespielt haben, erfüllt uns mit Stolz.",
        "author": "Kabeer, Gründer von Other Dev"
      },
      "secondCover": "/images/projects/groovy-pakistan-2024/second-cover.png"
    }
  },
  {
    "id": "3",
    "title": "Branding & Website-Entwicklung für Parcheh81",
    "company": "Parcheh",
    "hasPage": true,
    "year": "2024",
    "description": "Website-Design, Entwicklung & Branding",
    "imageSrc": "/images/projects/parcheh81-2024/Parcheh.nyc_collections_all.webp",
    "url": "https://parcheh81.com/",
    "coverImage": "/images/projects/parcheh81-2024/Parcheh.nyc_collections_all.webp",
    "coverImageAlt": "Parcheh Store Launch",
    "page": {
      "excerpt": "Unsere Zusammenarbeit mit Parcheh (persisch für 'Stoff') konzentrierte sich auf die Gestaltung eines digitalen Erlebnisses, das seinem Namen gerecht wird. Wir haben die einzigartige Textur, Kunstfertigkeit und Erzählung ihrer Textilien in eine maßgeschneiderte E-Commerce-Plattform übersetzt, auf der die Details des Stoffes wirklich zur Geltung kommen. Das Ergebnis ist eine elegante und intuitive Website, die den Nutzern eine immersive Reise in die Welt der Marke bietet und unsere Fähigkeit unterstreicht, die Kernessenz einer Marke durch anspruchsvolles digitales Design einzufangen.",
      "splitSections": [
        {
          "heading": "Herausforderungen",
          "content": "Für Parcheh umfassten die wichtigsten Herausforderungen die digitale Vermittlung des luxuriösen Gefühls ihrer Stoffe und die Balance zwischen einer anspruchsvollen Ästhetik und intuitiver Benutzerfreundlichkeit. Wir begegneten dem mit hochauflösenden Bildern, Zoomfunktionen und aussagekräftigen Beschreibungen, zusammen mit einem klaren UI/UX-Design mit übersichtlicher Navigation und einem optimierten Checkout. Entscheidend war auch, dass wir die Markengeschichte und das Engagement von Parcheh für Handwerkskunst durch spezielle Bereiche und subtile Designelemente auf der gesamten Website verwoben haben, um die Kundenbindung an ihr Erbe und ihre Qualität zu stärken.",
          "tags": [
            "Textilorientierte visuelle Strategie",
            "Visuelle Identität",
            "Shopify",
            "Kultursensibles UI/UX Design",
            "Hochwertige Produktpräsentation"
          ]
        },
        {
          "heading": "Inspiration",
          "content": "Tief inspiriert vom Stoff Parcheh selbst, konzentrierte sich unser Design darauf, seine taktile Reichhaltigkeit und Qualität in den digitalen Raum zu übertragen. Unser Ziel war es, zeitlose Handwerkskunst mit moderner Eleganz zu verbinden und ein intimes, galerieähnliches Online-Erlebnis zu schaffen. Hochwertige Bilder und klare, durchdachte Layouts waren entscheidend, um eine aufmerksame Erkundung der einzigartigen Kunstfertigkeit und des Erbes der Marke zu fördern."
        }
      ],
      "upperSlideshow": [
        "/images/projects/parcheh81-2024/parcheh-home-mobile.png",
        "/images/projects/parcheh81-2024/parcheh-menu-mobile.png",
        "/images/projects/parcheh81-2024/parcheh-logo-gridded.png",
        "/images/projects/parcheh81-2024/girl-standing-square.png"
      ],
      "testimonial": {
        "content": "Die Zusammenarbeit mit Other Dev hat Parcheh transformiert. Ihre kombinierte Web- und Branding-Expertise lieferte Ergebnisse, die unsere Erwartungen übertrafen. Die benutzerfreundliche Website erzielte einen dramatischen Umsatzanstieg, das anspruchsvolle Branding spiegelt unsere Identität perfekt wider und wird jetzt überall eingesetzt. Wir empfehlen Other Dev jedem Unternehmen, das wirkungsvolle digitale Ergebnisse benötigt, wärmstens.",
        "author": "Nasir, Gründer von Parcheh"
      },
      "secondCover": "https://images.unsplash.com/photo-1509114397022-ed747cca3f65?q=80&w=1935&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB%fHx8fA%3D%3D"
    }
  },
  {
    "id": "6",
    "title": "Zahlungsinfrastruktur-Migration für Tiny Footprint Coffee",
    "year": "2024",
    "description": "Website-Design, Recharge-Migration & Shopify-Theme-Entwicklung",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/tinyfootprintcoffee.webp",
    "url": "/blog/dc423a1a-f68e-42bd-a9b3-430bd57f82c1"
  },
  {
    "id": "7",
    "title": "Website-Entwicklung und Branding für Neubee's Tailors",
    "year": "2023",
    "description": "Design, Headless Shopify Deployment, Marketing & Website-Entwicklung",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/neubees.webp"
  },
  {
    "id": "8",
    "title": "Entwicklung der Unternehmensinfrastruktur für Ek Qadam Aur",
    "year": "2023",
    "description": "Website-Design, Website-Entwicklung & Infrastruktur",
    "imageSrc": "https://cdn.jsdelivr.net/gh/kabeer11000/docs-hosted@redirector-content/theotherdev/new-web/ekqadamaur.webp",
    "url": "http://ekqadamaur.kabeers.network/"
  }
]